// 4)	ჯეირანი (თამაში)
// a.	მომხარებელს შემოაქვს 3 მნიშვნელობიდან ერთ-ერთი: „მაკრატელი“, „ჭა“, „ქაღალდი“.
// b.	პირველ შემოტანილ მნიშვნელობას შევადარებთ მეორე შემოტანილ მნიშვნელობას და ჯეირანის წესების მიხედვით გამოვიტანთ ან გამარჯვებულს ან ფრის შედეგს.
// c.	საჭიროა ინპუტების ვალიდაცია


let player1 = prompt(`პირველი მოთამაშის არჩევანი - მაკრატელი , ჭა , ქაღალდი`);
if (player1 === `მაკრატელი` || player1 === `ჭა` || player1 === `ქაღალდი`){
    console.log(player1);
}
else{
    console.log(`არასწორი მცდელობა`);
}

let player2 = prompt(`მეორე მოთამაშის არჩევანი - მაკრატელი, ჭა, ქაღალდი`);
if (player2 === `მაკრატელი` || player2 === `ჭა` || player2 === `ქაღალდი`){
    console.log(player2);
}
else{
    console.log(`არასწორი მცდელობა`);  
}


if (player1 === player2){
    console.log(`ფრე`);
}
else if (player1 === `ჭა` && player2 === `მაკრატელი` || player1 === `ქაღალდი` && player2 === `ჭა` || player1 === `მაკრატელი` && player2 === `ქაღალდი`) {
    console.log(`გამარჯვებულია ${player1}`);
}
else {
    console.log(`გამარჯვებულია ${player2}`);
}