
// 2)	გამოიცანი რიცხვი (თამაში)
// a.	მომხარებელს შემოაქვს ჯერ 1 მნიშვნელობა, თუ რამდენი ცდის საშუალება აქვს.
// b.	კოდმა უნდა დააგენერიროს შემთხვევითი რიცხვი, რომელიც იქნება 1-დან 1000-მდე ინტერვალში მოთავსებული.
// c.	მომხარებელს აქვს უფლება იმდენჯერ შემოიტანს, რიცხვი რა რიცხვსაც მიუთითებს პირველ ინპუტზე. თუ ინპუტი იყო 0 ან NaN მაშინ მცდელობის რაოდენობა უნდა იყოს 10-ს ტოლი.
// d.	როცა შემოიტანს მნიშვნელობას (მცდელობის ფარგლებში) კოდმა უნდა დალოგოს: უფრო დაბალი, უფრო მაღალი ან სწორი გამოცნობა.


let num = Number(prompt(`რამდენ ცდაში შეძლებ რიცხვის გამოცნობას`));
if (num === 0){
    num = 10
}
let randomNum = Math.floor(Math.random() * 1000);
console.log(`გამოსაცნობი რიცხვია ${randomNum}`);
console.log(`თქვენი ცდების რაოდენობა - ${num}`);
let i;
for (i = 0; i < num; i++){
    let tryNum = Number(prompt(`სცადეთ გამოცნობა`));
    if (tryNum < randomNum){
        console.log(`${tryNum} - სცადე უფრო მაღალი რიცხვი`);
    }
    else if (tryNum > randomNum) {
        console.log(`${tryNum} - სცადე უფრო დაბალი რიცხვი`);
    }
    else if (tryNum === randomNum){
        console.log(`${tryNum} - ყოჩაღ!!!!! გამოიცანი`);
        break;
    }
    else {
        console.log(`${tryNum} - შეიყვანე რიცხვი`);
    }
}
if (i === num) {
    console.log(`ვერ გამოიცანი, ცდების რაოდენობა ამოიწურა`);
}

